In [1]:
import pandas as pd

In [2]:
#emptyt df
df=pd.DataFrame()
df

Empty DataFrame
Columns: []
Index: []

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 0 entries
Empty DataFrame

In [4]:
city=['Jhenaidah','Magura','Khulna']

In [5]:
city

['Jhenaidah', 'Magura', 'Khulna']

In [6]:
type(city)

list

In [7]:
df=pd.DataFrame(city)

In [8]:
df

           0
0  Jhenaidah
1     Magura
2     Khulna

In [25]:
df=pd.DataFrame(city,columns=['Bangladesh_city'])

In [26]:
df

  Bangladesh_city
0       Jhenaidah
1          Magura
2          Khulna

In [10]:
type(df)

pandas.core.frame.DataFrame

In [11]:
type(city)

list

In [12]:
row,col=df.shape

In [15]:
row

3

In [16]:
col

1

In [18]:
df.shape

(3, 1)

In [19]:
row

3

In [20]:
col

1

In [21]:
df

           0
0  Jhenaidah
1     Magura
2     Khulna

In [27]:
import pandas as pd

In [28]:
df=pd.DataFrame()

In [29]:
df

Empty DataFrame
Columns: []
Index: []

In [30]:
type(df)

pandas.core.frame.DataFrame

In [33]:
BME_students=['Shakib Al Hasan','Tanjim Hasan Ashik','Faisal','Fardin Islam','Salman','Fahad','Emamul Hossen','Shakil']

In [34]:
BME_students

['Shakib Al Hasan',
 'Tanjim Hasan Ashik',
 'Faisal',
 'Fardin Islam',
 'Salman',
 'Fahad',
 'Emamul Hossen',
 'Shakil']

In [35]:
type(BME_students)

list

In [36]:
df=pd.DataFrame(BME_students)

In [37]:
df

                    0
0     Shakib Al Hasan
1  Tanjim Hasan Ashik
2              Faisal
3        Fardin Islam
4              Salman
5               Fahad
6       Emamul Hossen
7              Shakil

In [39]:
df=pd.DataFrame(BME_students,columns=['Biomedical Engineering'],index=['1929001','1929002','1929003','1929005','1929006','1929007','1929008','1929011'])

In [40]:
df

        Biomedical Engineering
1929001        Shakib Al Hasan
1929002     Tanjim Hasan Ashik
1929003                 Faisal
1929005           Fardin Islam
1929006                 Salman
1929007                  Fahad
1929008          Emamul Hossen
1929011                 Shakil

In [41]:
subjects=['Biomaterials','Tissue & cell Engineering','Biostatistics','Signal & System','Communication Engineering','VIVA']

In [42]:
subjects

['Biomaterials',
 'Tissue & cell Engineering',
 'Biostatistics',
 'Signal & System',
 'Communication Engineering',
 'VIVA']

In [43]:
type(subjects)

list

In [44]:
df1=pd.DataFrame(subjects)

In [45]:
df1

                           0
0               Biomaterials
1  Tissue & cell Engineering
2              Biostatistics
3            Signal & System
4  Communication Engineering
5                       VIVA

In [50]:
df1=pd.DataFrame(zip(BME_students,subjects),columns=['Name','Subjects'])

In [47]:
df1

                    0                          1
0     Shakib Al Hasan               Biomaterials
1  Tanjim Hasan Ashik  Tissue & cell Engineering
2              Faisal              Biostatistics
3        Fardin Islam            Signal & System
4              Salman  Communication Engineering
5               Fahad                       VIVA

In [51]:
df1

                 Name                   Subjects
0     Shakib Al Hasan               Biomaterials
1  Tanjim Hasan Ashik  Tissue & cell Engineering
2              Faisal              Biostatistics
3        Fardin Islam            Signal & System
4              Salman  Communication Engineering
5               Fahad                       VIVA

In [52]:
df1=pd.DataFrame(zip(BME_students,subjects),columns=['Name','Subjects'],index=['R1','R2','R3','R4','R5','R6'])

In [53]:
df1

                  Name                   Subjects
R1     Shakib Al Hasan               Biomaterials
R2  Tanjim Hasan Ashik  Tissue & cell Engineering
R3              Faisal              Biostatistics
R4        Fardin Islam            Signal & System
R5              Salman  Communication Engineering
R6               Fahad                       VIVA

In [54]:
result=['3.50','3.75','3.56','3.77','3.80','3.93','3.55']

In [55]:
result

['3.50', '3.75', '3.56', '3.77', '3.80', '3.93', '3.55']

In [56]:
df1=pd.DataFrame(zip(BME_students,subjects,result),columns=['Name','Subjects','result'],index=['R1','R2','R3','R4','R5','R6'])

In [57]:
df1

                  Name                   Subjects result
R1     Shakib Al Hasan               Biomaterials   3.50
R2  Tanjim Hasan Ashik  Tissue & cell Engineering   3.75
R3              Faisal              Biostatistics   3.56
R4        Fardin Islam            Signal & System   3.77
R5              Salman  Communication Engineering   3.80
R6               Fahad                       VIVA   3.93

In [2]:
#Two dimensional data
import pandas as pd
bangladesh=[['Jhenaidah','Jhenaidah town'],['Magura','Magura Town'],['Kushtia','Kushtia Town']]

In [3]:
bangladesh

[['Jhenaidah', 'Jhenaidah town'],
 ['Magura', 'Magura Town'],
 ['Kushtia', 'Kushtia Town']]

In [4]:
type(bangladesh)

list

In [5]:
df3=pd.DataFrame(bangladesh)

In [6]:
df3

           0               1
0  Jhenaidah  Jhenaidah town
1     Magura     Magura Town
2    Kushtia    Kushtia Town

In [12]:
df3=pd.DataFrame(bangladesh,columns=['Zilla','Town _name'],index=['z1','z2','z3'])

In [13]:
df3

        Zilla      Town _name
z1  Jhenaidah  Jhenaidah town
z2     Magura     Magura Town
z3    Kushtia    Kushtia Town

In [1]:

    
dic={"name" : "Emamul",
      "versity" : "IU",
      "department" : "BME",
}  

dic

{'name': 'Emamul', 'versity': 'IU', 'department': 'BME'}

In [3]:
import pandas as pd

In [6]:
df4=pd.DataFrame(dic,index=['R1','R2','R3'])

In [7]:
df4

      name versity department
R1  Emamul      IU        BME
R2  Emamul      IU        BME
R3  Emamul      IU        BME

In [1]:
#Importing Excel File
import pandas as pd
df=pd.read_csv('cardio_train.csv')

In [2]:
df

      id;age;gender;height;weight;ap_hi;ap_lo;cholesterol;gluc;smoke;alco;active;cardio
0                  0;18393;2;168;62.0;110;80;1;1;0;0;1;0
1                  1;20228;1;156;85.0;140;90;3;1;0;0;1;1
2                  2;18857;1;165;64.0;130;70;3;1;0;0;0;1
3                 3;17623;2;169;82.0;150;100;1;1;0;0;1;1
4                  4;17474;1;156;56.0;100;60;1;1;0;0;0;0
...                                                  ...
69995          99993;19240;2;168;76.0;120;80;1;1;1;0;1;0
69996         99995;22601;1;158;126.0;140;90;2;2;0;0;1;1
69997         99996;19066;2;183;105.0;180;90;3;1;0;1;0;1
69998          99998;22431;1;163;72.0;135;80;1;2;0;0;0;1
69999          99999;20540;1;170;72.0;120;80;2;1;0;0;1;0

[70000 rows x 1 columns]

In [3]:
 df.head()

  id;age;gender;height;weight;ap_hi;ap_lo;cholesterol;gluc;smoke;alco;active;cardio
0              0;18393;2;168;62.0;110;80;1;1;0;0;1;0
1              1;20228;1;156;85.0;140;90;3;1;0;0;1;1
2              2;18857;1;165;64.0;130;70;3;1;0;0;0;1
3             3;17623;2;169;82.0;150;100;1;1;0;0;1;1
4              4;17474;1;156;56.0;100;60;1;1;0;0;0;0

In [4]:
df.head(10)

  id;age;gender;height;weight;ap_hi;ap_lo;cholesterol;gluc;smoke;alco;active;cardio
0              0;18393;2;168;62.0;110;80;1;1;0;0;1;0
1              1;20228;1;156;85.0;140;90;3;1;0;0;1;1
2              2;18857;1;165;64.0;130;70;3;1;0;0;0;1
3             3;17623;2;169;82.0;150;100;1;1;0;0;1;1
4              4;17474;1;156;56.0;100;60;1;1;0;0;0;0
5              8;21914;1;151;67.0;120;80;2;2;0;0;0;0
6              9;22113;1;157;93.0;130;80;3;1;0;0;1;0
7             12;22584;2;178;95.0;130;90;3;3;0;0;1;1
8             13;17668;1;158;71.0;110;70;1;1;0;0;1;0
9             14;19834;1;164;68.0;110;60;1;1;0;0;0;0

In [6]:
type(df)

pandas.core.frame.DataFrame

In [7]:
df.tail() #nece thake 5ta dataset show korbe

      id;age;gender;height;weight;ap_hi;ap_lo;cholesterol;gluc;smoke;alco;active;cardio
69995          99993;19240;2;168;76.0;120;80;1;1;1;0;1;0
69996         99995;22601;1;158;126.0;140;90;2;2;0;0;1;1
69997         99996;19066;2;183;105.0;180;90;3;1;0;1;0;1
69998          99998;22431;1;163;72.0;135;80;1;2;0;0;0;1
69999          99999;20540;1;170;72.0;120;80;2;1;0;0;1;0

In [8]:
df.head()

  id;age;gender;height;weight;ap_hi;ap_lo;cholesterol;gluc;smoke;alco;active;cardio
0              0;18393;2;168;62.0;110;80;1;1;0;0;1;0
1              1;20228;1;156;85.0;140;90;3;1;0;0;1;1
2              2;18857;1;165;64.0;130;70;3;1;0;0;0;1
3             3;17623;2;169;82.0;150;100;1;1;0;0;1;1
4              4;17474;1;156;56.0;100;60;1;1;0;0;0;0

In [9]:
df.head(10) # specific 10 dataset show korbe,first 10 ta

  id;age;gender;height;weight;ap_hi;ap_lo;cholesterol;gluc;smoke;alco;active;cardio
0              0;18393;2;168;62.0;110;80;1;1;0;0;1;0
1              1;20228;1;156;85.0;140;90;3;1;0;0;1;1
2              2;18857;1;165;64.0;130;70;3;1;0;0;0;1
3             3;17623;2;169;82.0;150;100;1;1;0;0;1;1
4              4;17474;1;156;56.0;100;60;1;1;0;0;0;0
5              8;21914;1;151;67.0;120;80;2;2;0;0;0;0
6              9;22113;1;157;93.0;130;80;3;1;0;0;1;0
7             12;22584;2;178;95.0;130;90;3;3;0;0;1;1
8             13;17668;1;158;71.0;110;70;1;1;0;0;1;0
9             14;19834;1;164;68.0;110;60;1;1;0;0;0;0

In [10]:
df.tail(10) # nes thake 10 ta show korbe

      id;age;gender;height;weight;ap_hi;ap_lo;cholesterol;gluc;smoke;alco;active;cardio
69990          99986;15094;1;168;72.0;110;70;1;1;0;0;1;1
69991          99988;20609;1;159;72.0;130;90;2;2;0;0;1;0
69992          99990;18792;1;161;56.0;170;90;1;1;0;0;1;1
69993          99991;19699;1;172;70.0;130;90;1;1;0;0;1;1
69994          99992;21074;1;165;80.0;150;80;1;1;0;0;1;1
69995          99993;19240;2;168;76.0;120;80;1;1;1;0;1;0
69996         99995;22601;1;158;126.0;140;90;2;2;0;0;1;1
69997         99996;19066;2;183;105.0;180;90;3;1;0;1;0;1
69998          99998;22431;1;163;72.0;135;80;1;2;0;0;0;1
69999          99999;20540;1;170;72.0;120;80;2;1;0;0;1;0

In [12]:
df.shape

(70000, 1)

In [14]:
rows,cols=df.shape

In [15]:
rows

70000

In [16]:
cols

1

In [17]:
df.values

array([['0;18393;2;168;62.0;110;80;1;1;0;0;1;0'],
       ['1;20228;1;156;85.0;140;90;3;1;0;0;1;1'],
       ['2;18857;1;165;64.0;130;70;3;1;0;0;0;1'],
       ...,
       ['99996;19066;2;183;105.0;180;90;3;1;0;1;0;1'],
       ['99998;22431;1;163;72.0;135;80;1;2;0;0;0;1'],
       ['99999;20540;1;170;72.0;120;80;2;1;0;0;1;0']], dtype=object)

In [18]:
print(df.values)

[['0;18393;2;168;62.0;110;80;1;1;0;0;1;0']
 ['1;20228;1;156;85.0;140;90;3;1;0;0;1;1']
 ['2;18857;1;165;64.0;130;70;3;1;0;0;0;1']
 ...
 ['99996;19066;2;183;105.0;180;90;3;1;0;1;0;1']
 ['99998;22431;1;163;72.0;135;80;1;2;0;0;0;1']
 ['99999;20540;1;170;72.0;120;80;2;1;0;0;1;0']]

In [20]:
print(df.columns)

Index(['id;age;gender;height;weight;ap_hi;ap_lo;cholesterol;gluc;smoke;alco;active;cardio'], dtype='object')

In [21]:
print(df.index)

RangeIndex(start=0, stop=70000, step=1)

In [17]:
#to show specific column
df.gender

AttributeError: 'DataFrame' object has no attribute 'gender'

In [2]:
import pandas as pd
df=pd.read_csv('country_wise_latest (1).csv')

In [3]:
df

,Country/Region,Confirmed,Deaths,Recovered,Active,New cases,New deaths,New recovered,Deaths / 100 Cases,Recovered / 100 Cases,Deaths / 100 Recovered,Confirmed last week,1 week change,1 week % increase,WHO Region
0,Afghanistan,36263,1269,25198,9796,106,10,18,3.50,69.49,5.04,35526,737,2.07,Eastern Mediterranean
1,Albania,4880,144,2745,1991,117,6,63,2.95,56.25,5.25,4171,709,17.00,Europe
2,Algeria,27973,1163,18837,7973,616,8,749,4.16,67.34,6.17,23691,4282,18.07,Africa
3,Andorra,907,52,803,52,10,0,0,5.73,88.53,6.48,884,23,2.60,Europe
4,Angola,950,41,242,667,18,1,0,4.32,25.47,16.94,749,201,26.84,Africa
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
182,West Bank and Gaza,10621,78,3752,6791,152,2,0,0.73,35.33,2.08,8916,1705,19.12,Eastern Mediterranean
183,Western Sahara,10,1,8,1,0,0,0,10.00,80.00,12.50,10,0,0.00,Africa
184,Yemen,1691,483,833,375,10,4,36,28.56,49.26,57.98,1619,72,4.45,Eastern Mediterranean
185,Zambia,4552,140,2815,1597,71,1,465,3.08,61.84,4.97,3326,1226,36.86,Africa
186,Zimbabwe,2704,36,542,2126,192,2,24,1.33,20.04,6.64,1713,991,57.85,Africa

In [4]:
df.values

array([['Afghanistan', 36263, 1269, ..., 737, 2.07,
        'Eastern Mediterranean'],
       ['Albania', 4880, 144, ..., 709, 17.0, 'Europe'],
       ['Algeria', 27973, 1163, ..., 4282, 18.07, 'Africa'],
       ...,
       ['Yemen', 1691, 483, ..., 72, 4.45, 'Eastern Mediterranean'],
       ['Zambia', 4552, 140, ..., 1226, 36.86, 'Africa'],
       ['Zimbabwe', 2704, 36, ..., 991, 57.85, 'Africa']], dtype=object)

In [5]:
df.head()

,Country/Region,Confirmed,Deaths,Recovered,Active,New cases,New deaths,New recovered,Deaths / 100 Cases,Recovered / 100 Cases,Deaths / 100 Recovered,Confirmed last week,1 week change,1 week % increase,WHO Region
0,Afghanistan,36263,1269,25198,9796,106,10,18,3.50,69.49,5.04,35526,737,2.07,Eastern Mediterranean
1,Albania,4880,144,2745,1991,117,6,63,2.95,56.25,5.25,4171,709,17.00,Europe
2,Algeria,27973,1163,18837,7973,616,8,749,4.16,67.34,6.17,23691,4282,18.07,Africa
3,Andorra,907,52,803,52,10,0,0,5.73,88.53,6.48,884,23,2.60,Europe
4,Angola,950,41,242,667,18,1,0,4.32,25.47,16.94,749,201,26.84,Africa

In [6]:
df.head(10)

,Country/Region,Confirmed,Deaths,Recovered,Active,New cases,New deaths,New recovered,Deaths / 100 Cases,Recovered / 100 Cases,Deaths / 100 Recovered,Confirmed last week,1 week change,1 week % increase,WHO Region
0,Afghanistan,36263,1269,25198,9796,106,10,18,3.50,69.49,5.04,35526,737,2.07,Eastern Mediterranean
1,Albania,4880,144,2745,1991,117,6,63,2.95,56.25,5.25,4171,709,17.00,Europe
2,Algeria,27973,1163,18837,7973,616,8,749,4.16,67.34,6.17,23691,4282,18.07,Africa
3,Andorra,907,52,803,52,10,0,0,5.73,88.53,6.48,884,23,2.60,Europe
4,Angola,950,41,242,667,18,1,0,4.32,25.47,16.94,749,201,26.84,Africa
5,Antigua and Barbuda,86,3,65,18,4,0,5,3.49,75.58,4.62,76,10,13.16,Americas
6,Argentina,167416,3059,72575,91782,4890,120,2057,1.83,43.35,4.21,130774,36642,28.02,Americas
7,Armenia,37390,711,26665,10014,73,6,187,1.90,71.32,2.67,34981,2409,6.89,Europe
8,Australia,15303,167,9311,5825,368,6,137,1.09,60.84,1.79,12428,2875,23.13,Western Pacific
9,Austria,20558,713,18246,1599,86,1,37,3.47,88.75,3.91,19743,815,4.13,Europe

In [7]:
rows,cols=df.shape

In [8]:
rows

187

In [9]:
cols

15

In [10]:
print(df.index)

RangeIndex(start=0, stop=187, step=1)

In [11]:
print(df.columns)

Index(['Country/Region', 'Confirmed', 'Deaths', 'Recovered', 'Active',
       'New cases', 'New deaths', 'New recovered', 'Deaths / 100 Cases',
       'Recovered / 100 Cases', 'Deaths / 100 Recovered',
       'Confirmed last week', '1 week change', '1 week % increase',
       'WHO Region'],
      dtype='object')

In [12]:
df.tail()

,Country/Region,Confirmed,Deaths,Recovered,Active,New cases,New deaths,New recovered,Deaths / 100 Cases,Recovered / 100 Cases,Deaths / 100 Recovered,Confirmed last week,1 week change,1 week % increase,WHO Region
182,West Bank and Gaza,10621,78,3752,6791,152,2,0,0.73,35.33,2.08,8916,1705,19.12,Eastern Mediterranean
183,Western Sahara,10,1,8,1,0,0,0,10.00,80.00,12.50,10,0,0.00,Africa
184,Yemen,1691,483,833,375,10,4,36,28.56,49.26,57.98,1619,72,4.45,Eastern Mediterranean
185,Zambia,4552,140,2815,1597,71,1,465,3.08,61.84,4.97,3326,1226,36.86,Africa
186,Zimbabwe,2704,36,542,2126,192,2,24,1.33,20.04,6.64,1713,991,57.85,Africa

In [13]:
df.tail(10)

,Country/Region,Confirmed,Deaths,Recovered,Active,New cases,New deaths,New recovered,Deaths / 100 Cases,Recovered / 100 Cases,Deaths / 100 Recovered,Confirmed last week,1 week change,1 week % increase,WHO Region
177,United Kingdom,301708,45844,1437,254427,688,7,3,15.19,0.48,3190.26,296944,4764,1.60,Europe
178,Uruguay,1202,35,951,216,10,1,3,2.91,79.12,3.68,1064,138,12.97,Americas
179,Uzbekistan,21209,121,11674,9414,678,5,569,0.57,55.04,1.04,17149,4060,23.67,Europe
180,Venezuela,15988,146,9959,5883,525,4,213,0.91,62.29,1.47,12334,3654,29.63,Americas
181,Vietnam,431,0,365,66,11,0,0,0.00,84.69,0.00,384,47,12.24,Western Pacific
182,West Bank and Gaza,10621,78,3752,6791,152,2,0,0.73,35.33,2.08,8916,1705,19.12,Eastern Mediterranean
183,Western Sahara,10,1,8,1,0,0,0,10.00,80.00,12.50,10,0,0.00,Africa
184,Yemen,1691,483,833,375,10,4,36,28.56,49.26,57.98,1619,72,4.45,Eastern Mediterranean
185,Zambia,4552,140,2815,1597,71,1,465,3.08,61.84,4.97,3326,1226,36.86,Africa
186,Zimbabwe,2704,36,542,2126,192,2,24,1.33,20.04,6.64,1713,991,57.85,Africa

In [14]:
#To show specific Column
df.Confirmed

0      36263
1       4880
2      27973
3        907
4        950
       ...
182    10621
183       10
184     1691
185     4552
186     2704
Name: Confirmed, Length: 187, dtype: int64

In [15]:
print([df.Confirmed])

[0      36263
1       4880
2      27973
3        907
4        950
       ...
182    10621
183       10
184     1691
185     4552
186     2704
Name: Confirmed, Length: 187, dtype: int64]

In [16]:
[[df.Confirmed]]

[[0      36263
  1       4880
  2      27973
  3        907
  4        950
         ...
  182    10621
  183       10
  184     1691
  185     4552
  186     2704
  Name: Confirmed, Length: 187, dtype: int64]]

In [18]:
df.Deaths

0      1269
1       144
2      1163
3        52
4        41
       ...
182      78
183       1
184     483
185     140
186      36
Name: Deaths, Length: 187, dtype: int64

In [19]:
df.Deaths.head(10)

0    1269
1     144
2    1163
3      52
4      41
5       3
6    3059
7     711
8     167
9     713
Name: Deaths, dtype: int64

In [20]:
df.Deaths.tail(10)

177    45844
178       35
179      121
180      146
181        0
182       78
183        1
184      483
185      140
186       36
Name: Deaths, dtype: int64

In [2]:
import pandas as pd
df=pd.read_csv('cardio_train.csv')

In [3]:
df

      id;age;gender;height;weight;ap_hi;ap_lo;cholesterol;gluc;smoke;alco;active;cardio
0                  0;18393;2;168;62.0;110;80;1;1;0;0;1;0
1                  1;20228;1;156;85.0;140;90;3;1;0;0;1;1
2                  2;18857;1;165;64.0;130;70;3;1;0;0;0;1
3                 3;17623;2;169;82.0;150;100;1;1;0;0;1;1
4                  4;17474;1;156;56.0;100;60;1;1;0;0;0;0
...                                                  ...
69995          99993;19240;2;168;76.0;120;80;1;1;1;0;1;0
69996         99995;22601;1;158;126.0;140;90;2;2;0;0;1;1
69997         99996;19066;2;183;105.0;180;90;3;1;0;1;0;1
69998          99998;22431;1;163;72.0;135;80;1;2;0;0;0;1
69999          99999;20540;1;170;72.0;120;80;2;1;0;0;1;0

[70000 rows x 1 columns]

In [1]:
import pandas as pd
df=pd.read_csv('brain_stroke.csv')

In [2]:
df

,gender,age,hypertension,heart_disease,ever_married,work_type,Residence_type,avg_glucose_level,bmi,smoking_status,stroke
0,Male,67.0,0,1,Yes,Private,Urban,228.69,36.6,formerly smoked,1
1,Male,80.0,0,1,Yes,Private,Rural,105.92,32.5,never smoked,1
2,Female,49.0,0,0,Yes,Private,Urban,171.23,34.4,smokes,1
3,Female,79.0,1,0,Yes,Self-employed,Rural,174.12,24.0,never smoked,1
4,Male,81.0,0,0,Yes,Private,Urban,186.21,29.0,formerly smoked,1
...,...,...,...,...,...,...,...,...,...,...,...
4976,Male,41.0,0,0,No,Private,Rural,70.15,29.8,formerly smoked,0
4977,Male,40.0,0,0,Yes,Private,Urban,191.15,31.1,smokes,0
4978,Female,45.0,1,0,Yes,Govt_job,Rural,95.02,31.8,smokes,0
4979,Male,40.0,0,0,Yes,Private,Rural,83.94,30.0,smokes,0
4980,Female,80.0,1,0,Yes,Private,Urban,83.75,29.1,never smoked,0

In [3]:
df.values

array([['Male', 67.0, 0, ..., 36.6, 'formerly smoked', 1],
       ['Male', 80.0, 0, ..., 32.5, 'never smoked', 1],
       ['Female', 49.0, 0, ..., 34.4, 'smokes', 1],
       ...,
       ['Female', 45.0, 1, ..., 31.8, 'smokes', 0],
       ['Male', 40.0, 0, ..., 30.0, 'smokes', 0],
       ['Female', 80.0, 1, ..., 29.1, 'never smoked', 0]], dtype=object)

In [4]:
print(df.index)

RangeIndex(start=0, stop=4981, step=1)